n5/src/Catalogs/Cars/Cars.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Cars</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CarType</name>
    <type>
      <types>CatalogRef.CarTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>BodyNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CarNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ChassisNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Contractor</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Driver</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FixedAsset</name>
    <type>
      <types>CatalogRef.FixedAssets</types>
    </type>
  </attributes>
  <attributes>
    <name>GarageNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MotorNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Catalogs/Cars/ObjectModule.bsl
Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not checkCarAndAsset () ) then
		Cancel = true;
	endif; 
	
EndProcedure

Function checkCarAndAsset ()
	
	s = "
	|select top 1 presentation ( Cars.Warehouse ) as Warehouse, presentation ( Cars.FixedAsset ) as FixedAsset, presentation ( Cars.Ref ) as Car
	|from Catalog.Cars as Cars
	|where Cars.Ref <> &Ref
	|and ( Cars.Warehouse = &Warehouse
	|or ( Cars.FixedAsset = &FixedAsset and Cars.FixedAsset <> value ( Catalog.FixedAssets.EmptyRef ) ) )
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	q.SetParameter ( "Warehouse", Warehouse );
	q.SetParameter ( "FixedAsset", FixedAsset );
	table = q.Execute ().Unload ();
	if ( table.Count () = 0 ) then
		return true;
	endif; 
	p = new Structure ( "Car, Warehouse, FixedAsset" );
	FillPropertyValues ( p, table [ 0 ] );
	Output.CarAccountingDataError ( p );
	return false;
	
EndFunction
